# Задача N-12 "Остаток от деления большего натурального числа на меньшее или равное натуральное с остатком(делитель отличен от нуля)"
# Выполнил Козориз К.И.
#
# Входные данные:
# Программа принимает на вход два массива целых чисел, представленных таким образом:
# Число n, обозначающее кол-во разрядов, и массив A[...] размера n, содержащий цифры в этих разрядах.
#
# Алгоритм:
# Так как порядок коэффициентов идет от старшего к младшему, функция возвращает первый элемент массива
#
# Выходные данные:
# Программа возвращает массив целых чисел  - остаток от деления

num1 = [1, 2, 3, 4, 5, 6]
num2 = [1, 2, 3]

num1_number_of_digits = 6
num2_number_of_digits = 3

def MOD_NN_N(num1, num2, num1_number_of_digits, num2_number_of_digits):
"""
    count = DIV_NN_N(num1, num2, num1_number_of_digits, num2_number_of_digits) 
    находим частное от деления большего натурального числа на меньшее и присваиваем его в переменную

    return [SUB_NDN_N(count, mass1, mass2)]
    Возвращаем вычитание из большего числа меньшее, умноженное на частное от деления большего натурального числа на меньшее (count)
"""

